//=============================================================================
//
//  ゴール [goal.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _GOAL_H_
#define _GOAL_H_
//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "model.h"
#include "meshfield_cylinder.h"
#include "manager.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CModel;
class CMesh_Cylinder;
class CManager;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGoal :public CMeshCylinder
{
public:
	CGoal();
	~CGoal();

	static CGoal* Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 size, D3DXCOLOR col, CManager::GAMEMODE Mode);

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void HitGoal(void);
private:

	LPDIRECT3DTEXTURE9		m_pTexture;		// テクスチャへのポインタ
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		// 頂点バッファへのポインタ
	LPDIRECT3DINDEXBUFFER9 m_pIdxBuff;		//インデックスバッファへのポイント
	D3DXMATRIX m_mtxWorld;					//行列計算用
	CMesh_Cylinder *m_pMeshCylinder;		//メッシュフィールド円柱のポイント
	CManager::GAMEMODE m_GameMode;
};
#endif