//=============================================================================
//
// ゲーム処理 [tutorial.cpp]
// Author : 吉田　悠人
//
//=============================================================================
#include "manager.h"
#include "game.h"

//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//コンストラクタ
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
CGame::CGame()
{

}

//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//デストラクタ
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
CGame::~CGame()
{

}

//・・・・・・・・・・・・・・・・・・・・・・・・・・・
// 生成処理関数
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
CGame * CGame::Create(void)
{
	CGame *pGame;
	//インスタンス生成
	pGame = new CGame;
	//初期化処理
	if (pGame != NULL)
	{
		pGame->Init();
	}
	return pGame;
}

//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//初期化関数
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
HRESULT  CGame::Init(void)
{
	return S_OK;
}

//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//終了関数
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
void CGame::Uninit(void)
{
	Release();
}
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//更新関数
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
void CGame::Update(void)
{

}
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
//描画関数
//・・・・・・・・・・・・・・・・・・・・・・・・・・・
void CGame::Draw(void)
{
}