//=============================================================================
//
// マップ03 [map03.h]
// Author : 二階堂汰一
//
//=============================================================================
#ifndef _MAP03_H_
#define _MAP03_H_
//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "gamemode.h"
#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCamera;
class CStage03;
class CPlayer;
class CObstacle;
class CLightEnemy;
class CUav;
class CHeavyEnemy;
class CComputer;
//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMap03 : public CGamemode
{
public:
	CMap03();
	~CMap03();
	HRESULT Init(void);
	void Update(void);
	void Draw(void);
	void Uninit(void);
private:
	CCamera* m_pCamera;			//カメポインタ
	CPlayer* m_pPlayer;			//プレイヤーポインタ		
	CStage03* m_pStage03;		//マップモデルポインタ
	CObstacle* m_pObstacle;		//障害物ポインタ
	CLightEnemy *m_pLightEnemy[6];		//軽装エネミーポインタ
	CUav *m_pUav[3];					//偵察機ポインタ
	CHeavyEnemy *m_pHeavyEnemy[1];		//重装エネミーポインタ
	bool bCollEnemy[3];					//エネミーが増えているか
	CComputer *m_pComputer;

};
#endif
